InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЦенПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыЦенПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розничная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дисконт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСЦенамиСервер/Ext/Module.bsl
Функция ПолучитьЦенуПродажиНаДату (Номенклатура, ВидЦены = Неопределено, ДатаЦены = Неопределено) Экспорт          
	 Если ВидЦены = Неопределено Тогда
		 ВидЦены = Перечисления.ВидыЦенПродажи.Розничная;
	 КонецЕсли; 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	                |	ЦеныНоменклатурыСрезПоследних.Сумма КАК Цена
	                |ИЗ
	                |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                |			&Период,
	                |			Номенклатура = &Номенклатура
	                |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних"; 
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("Период", ДатаЦены);
	 Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Если РезультатЗапроса.Пустой() Тогда
		 Сообщить("В базе данных не найдены цены для данной номенклатуры!");
		 возврат 0;
	 КонецЕсли;
	 
	 Выборка = РезультатЗапроса.Выбрать();  
	 
	 Выборка.Следующий();
	 
	 Возврат Выборка.Цена; 
	 
 КонецФункции
